[
	{
		"slug": "layout-garden",
		"template": "projects",


		"title1": "Layout",
		"title2": "Garden",
		"intro": "Not really a project, but shows off a bunch of responsive modules that are common on modern websites",
		"url": "https://peprojects.dev/alpha-4/john/layout-challenges/index.php",
		"image": "images/layouts.png",
		"featured": true,
		"languages": [
			"HTML", "CSS", "PHP"
		], 

		"sections": [
			{
				"module": "generic-text",
				"content": "If you're on a computer, try horizontally expanding and contracting your window to see how the modules <em>respond</em> to the window size :)"
			}
		]
	},
	{
		"title1": "Form",
		"title2": "Exercises",
		"slug": "exercises",
		"intro": "We created a bunch of forms using the book, Exercises for Programmers. It gave us the opportunity to think through functions and create programs with PHP and Javascript.",
		"url": "https://peprojects.dev/alpha-4/john/layout-challenges/index.php",
		"image": "images/forms2.jpg",
		"featured": false,
		"languages": [
			"HTML", "CSS", "PHP", "Javascript"
		], 

		"sections": [
			{
				"module": "generic-text",
				"content": "Click on a form!"
			}
		]
	},
	{
		"title1": "Luxury",
		"title2": "Streetwear",
		"slug": "luxury-streetwear",
		"intro": "We were given a base code to style and emulate an industry of our choice. I chose, 'Luxury Streetwear' for my project.",
		"url": "https://peprojects.dev/alpha-4/john/projects/layout-theme-challenge/index.php",
		"image": "images/fashion-site.png",
		"featured": true,
		"languages": [
			"HTML", "CSS", "PHP"
		], 

		"sections": [
			{	
				"module": "generic-text",
				"subHeader": "The Challenge",
				"content": "We were tasked to emulate a website in an industry of our choice. The goal was to make it look it <i>belonged</i> and indistinguishable from another site within that industry. We've always been told to build something toward a field we want to work in. Currently my interests lie in sports, fashion and web3 so I chose \"Luxury Streetwear\" to emulate as their sites were the most interesting. They had some unique layouts and I liked their clean, modern aesthetics."
			},
			{	
				"module": "generic-text",
				"subHeader": "The Research",
				"content": "The first step was to research different sites within our chosen industry. I looked at <a href='https://kith.com/' target='_blank'>Kith</a>, <a href='https://www.acnestudios.com/us/en/home' target='_blank'>Acne Studios</a>, <a href='https://www.saturdaysnyc.com/' target='_blank'>Staruday’s NYC</a>, <a href='https://fearofgod.com/' target='_blank'>Fear of God</a> and <a href='https://www.johnelliott.com/' target='_blank'>John Elliott</a> to draw inspiration. They all employed very similar styles. They used only white and black and let their photos carry all of the color. They all included large images that sometimes covered the entire width of the screen to showcase their products and bring emotion to the site. <br><br>I also noticed they mostly used uppercase, sans-serif fonts. Below is the moodboard I created where I pulled different headers, fonts, images and visual treatments they used for my own inspiration."
			},
			{
				"module": "figure",
				"filePath": "images/luxury-streetwear-mood-board.png",
				"altText":	"Luxury streetwear moodboard from researched sites.",
				"figureHeading": "Moodboard",
				"caption": "The moodboard where I pulled visual treatments from the researched sites."
			},
			{	
				"module": "generic-text",
				"subHeader": "The Style",
				"content": "After getting an idea of the overall look and feel of a Luxury Streetwear site, it was time to build the visual language of my site. Still without coding anything yet, we created <b>Style Tiles</b>. This allows us to communicate a visual story with examples of colors, headers, font sizes and styles, images and any other visual elements that may be employed on the actual site. "
			},
			{
				"module": "figure",
				"filePath": "images/luxury-streetwear-style-tile.png",
				"altText":	"Luxury streetwear moodboard from researched sites.",
				"figureHeading": "Moodboard",
				"caption": "The visual language of my site represented through a Style Tile."
			},
			{	
				"module": "generic-text",
				"subHeader": "The Finished Product",
				"content": "Now that I had the visual langauge done, it was time to build the site. We were given the base code and it was our job to style it according to our Style Tile. It was the first time we worked with a large file system so it was a bit of a learning curve to get used to working with a robust website. However, this set the foundation for all future sites, including this one with.<br><br><a href='https://peprojects.dev/alpha-4/john/projects/layout-theme-challenge/index.php'>Visit the Site here!</a>"
			}
		]
	}
]