[
	{
		"slug": "gsap",
		"template": "projects",
		"title1": "GSAP",
		"title2": "Layout",
		"intro": "Practicing GreenSock web animation",
		"image": "images/projects/layouts2.png",
		"featured": true,
		"languages": [
			"JS", "HTML", "CSS", "PHP"
		], 

		"sections": [
			{
				"module": "generic-text",
				"subHeader": "Why Learn Greensock?",
				"content": "As I've been learning Web Development, I've started to gravitate toward the Frontend side of programming. I like finding fun and interesting sites that have a lot of neat interactions that inspire me. Most of these sites include some sort of web animation, whether its a scroll-trigger, an element moving across the screen or a background that moves like a living organism. To step my game up, I tried taking a stab with the GreenSock Animation Platform (GSAP). GSAP has taken all of the complicated math and packaged them into \"easey-to-use\" methods that allow you to animate elements on your page in various ways and through different triggers. Fun, right?"
			},
			{
				"module": "figure",
				"filePath": "images/projects/shoe-animation/dribbble-layout.gif",
				"altText":	"The Dribbble layout with the page animations as a gif",
				"figureHeading": "Animated Page",
				"caption": "The Dribble layout we chose to copy."
			},
			{
				"module": "generic-text",
				"subHeader": "The Process",
				"content": "Instead of starting from scratch and creating my own webpage, I worked with my mentor, Derek Wood who helped me find a layout on <a href='https://dribbble.com/shots/15359806-Nike-Shoe-Web-Header' target='_blank'>Dribbble</a> that I could recreate. At first glance, it seemed daunting. Not impossible, but definitely challenging. However, once Derek broke down the site into peices, it became much more doable. First, I just needed to get the layout down. Something that I feel very comfortable doing. Then once the elements are in place, I can work with GSAP and add in the animations."
			},
			{
				"module": "figure",
				"filePath": "images/projects/shoe-animation/page-breakdown.png",
				"altText":	"The layout with outlines of each element to better breakdown the page.",
				"figureHeading": "Page Breakdown",
				"caption": "Breaking down the page into it's elements."
			},
			{
				"module": "generic-text",
				"subHeader": "Challenges",
				"content": "There were a few challenges I came across as I worked on this layout. One minor one was thinking about the mobile view. I felt that this would require too much design thinking, I completely scrapped it as it would take away from my main purpose and goal of learning and using GSAP. I just left it with a fixed height and width.<br><br> Another challenge I faced was actually with the buildout of the site. I struggled with the bottom right corner, where it displays the shoe sizes, specifically that little knob in the middle. I tried using CSS to create the knob, but adjusting the background of the \"10\". I ended up creating an SVG for the entire black background and setting it as the background image. <br><br> Now comes the real challenge of learning and using GSAP. Derek had done a couple examples for me in codepen and GSAP has some good documentation and example animations on their site. It wasn't too difficult getting the first few animations up and running. It became a bit of a challenge to time the animations and have them appear in order. The spinning Explore wheel and the little pop-up icons took awhile for me to get in place as they required additional animation features. Fortunately, GSAP gives you tools to set the timing and order. It took some  trial and error, but I eventually got it. "
			},
			{
				"module": "figure",
				"filePath": "images/projects/shoe-animation/completed-layout.gif",
				"altText":	"The webpage as a gif with the GSAP animations.",
				"figureHeading": "Animated Page",
				"caption": "The final product."
			},
			{
				"module": "button",
				"content": "Live Site",
				"link": "https://peprojects.dev/alpha-4/john/projects/shoe-animation-layout/"
			},
			{
				"module": "button",
				"content": "GitHub",
				"link": "https://github.com/MiyaoCat/portfolio-site/tree/main/projects/shoe-animation-layout"
			}
		]
	},	
	{
		"slug": "layout-garden",
		"template": "projects",
		"title1": "Layout",
		"title2": "Garden",
		"intro": "Not necessarily a project, rather a collection of responsive modules I've built that are common on modern websites.",
		"image": "images/projects/layouts2.png",
		"featured": true,
		"languages": [
			"HTML", "CSS", "PHP"
		], 

		"sections": [
			{
				"module": "generic-text",
				"subHeader": "",
				"content": "My Layout Garden is a collection of responsive modules I built throughout the course and beyond. They're common modules you see on websites that employ either flexbox, grid or both. If you're on a computer, try expanding and contracting your window to see how the modules <b>respond</b> to the window size :)"
			},
			{
				"module": "button",
				"content": "See Modules",
				"link": "projects/layout-challenges/index.php"
			},
			{
				"module": "button",
				"content": "GitHub",
				"link": "https://github.com/MiyaoCat/portfolio-site/tree/main/projects/layout-challenges"
			}
		]
	},
	{
		"title1": "Form",
		"title2": "Exercises",
		"slug": "exercises",
		"intro": "A variety of forms derived from the book, Exercises for Programmers by Brian Hogan.",
		"image": "images/projects/forms2.jpg",
		"featured": false,
		"languages": [
			"HTML", "CSS", "PHP", "Javascript", "Vue"
		], 

		"sections": [
			{
				"module": "generic-text",
				"content": "I worked through the book, Exercises for Programmers to build out each form. This book is language agnostic and tests your ability to use functions and logic to create each form. I recommend using this book when learning any new programming language. <br><br> Now click on a form and test them out!"
			}
		]
	},
	{
		"title1": "Luxury",
		"title2": "Streetwear",
		"slug": "luxury-streetwear",
		"intro": "My attempt at emulating a website in the \"Luxury Streetwear\" industry.",
		"url": "https://peprojects.dev/alpha-4/john/projects/layout-theme-challenge/index.php",
		"image": "images/projects/fashion-site.png",
		"featured": true,
		"languages": [
			"HTML", "CSS", "PHP"
		], 

		"sections": [
			{	
				"module": "generic-text",
				"class": "luxury-streetwear",
				"subHeader": "The Challenge",
				"content": "We were tasked to emulate a website in an industry of our choice. The goal was to make it look it <i>belonged</i> and indistinguishable from another site within that industry. We've always been told to build something toward a field we want to work in. Currently my interests lie in sports, fashion and web3 so I chose \"Luxury Streetwear\" to emulate as their sites were the most interesting. They had some unique layouts and I liked their clean, modern aesthetics."
			},
			{	
				"module": "generic-text",
				"subHeader": "The Research",
				"content": "The first step was to research different sites within our chosen industry. I looked at <a href='https://kith.com/' target='_blank'>Kith</a>, <a href='https://www.acnestudios.com/us/en/home' target='_blank'>Acne Studios</a>, <a href='https://www.saturdaysnyc.com/' target='_blank'>Staruday’s NYC</a>, <a href='https://fearofgod.com/' target='_blank'>Fear of God</a> and <a href='https://www.johnelliott.com/' target='_blank'>John Elliott</a> to draw inspiration. They all employed very similar styles. They used only white and black and let their photos carry all of the color. They all included large images that sometimes covered the entire width of the screen to showcase their products and bring emotion to the site. <br><br>I also noticed they mostly used uppercase, sans-serif fonts. Below is the moodboard I created where I pulled different headers, fonts, images and visual treatments they used for my own inspiration."
			},
			{
				"module": "figure",
				"filePath": "images/projects/luxury-streetwear/luxury-streetwear-mood-board.png",
				"altText":	"Luxury streetwear moodboard from researched sites.",
				"figureHeading": "Moodboard",
				"caption": "The moodboard where I pulled visual treatments from the researched sites."
			},
			{	
				"module": "generic-text",
				"subHeader": "The Style",
				"content": "After getting an idea of the overall look and feel of a Luxury Streetwear site, it was time to build the visual language of my site. Before coding anything yet, we created <b>Style Tiles</b>. This allowed us to communicate a visual story with examples of colors, headers, font sizes and styles, images and any other visual elements that may be employed on the actual site. "
			},
			{
				"module": "figure",
				"filePath": "images/projects/luxury-streetwear/luxury-streetwear-style-tile.png",
				"altText":	"Luxury streetwear moodboard from researched sites.",
				"figureHeading": "Moodboard",
				"caption": "The visual language of my site represented through a Style Tile."
			},
			{	
				"module": "generic-text",
				"subHeader": "The Finished Product",
				"content": "Now that I had the visual langauge done, it was time to build the site. We were given the base code and it was our job to style it according to our Style Tile. It was interesting to see how different each student's page was despite having the same base code. It was the first time we worked with a large file system so it was a bit of a learning curve to get used to working with a robust website. However, this set the foundation for all future sites, including this one."
			},
			{
				"module": "button",
				"content": "Visit Site",
				"link": "https://peprojects.dev/alpha-4/john/projects/layout-theme-challenge/index.php"
			},
			{
				"module": "button",
				"content": "GitHub",
				"link": "https://github.com/MiyaoCat/portfolio-site/tree/main/projects/layout-theme-challenge"
			}
		]
	},
	{
		"title1": "Portfolio",
		"title2": "Site",
		"slug": "portfolio-site",
		"intro": "I walk you through the process and struggles of building this site.",
		"url": "https://peprojects.dev/alpha-4/john/",
		"image":"images/projects/portfolio.png",
		"featured": false,
		"languages": [
			"HTML", "CSS", "PHP"
		], 

		"sections": [
			{	
				"module": "generic-text",
				"subHeader": "The Content",
				"content": "First we wrote out the goals and content for our site. What do we want to achieve with our personal site and what are it’s intentions? Mine of course is to showcase my work and ultimately help me get a job as Web Developer.<br><br>We need to know what we’re going to fill our site with before we start building it. For some reason this was a hard concept for me to grasp. It felt like I was furnishing a house before it's getting built. When building out a site, it’s easier to build when we know the size and amount of content. For example what will the header titles be? Will it be a couple long words or a bunch of short words? Once we have a good idea of the content, then we can start designing the site around the content."
			},
			{
				"module": "figure",
				"filePath": "images/projects/portfolio/outline.png",
				"altText":	"Luxury streetwear moodboard from researched sites.",
				"figureHeading": "Style Tile",
				"caption": "Writing out the content of my portfolio."
			},
			{	
				"module": "generic-text",
				"subHeader": "Content In Context",
				"content": "Next we started creating some designs with a bit of content. This helped us visualize how we wanted the content to sit on the page or within the modules. This allowed us to explore different ways to display the content. I focused primarily on the Project Cards. I had a pretty good idea of how I wanted to display the info so I mocked up how it might appear on mobile and desktop. "
			},
			{
				"module": "figure",
				"filePath": "images/projects/portfolio/context.png",
				"altText":	"Visual ideas of the menu, footer, proejct cards and About Me pages.",
				"figureHeading": "Moodboard",
				"caption": "Adding some visual context with the content I wrote out."
			},
			{	
				"module": "generic-text",
				"subHeader": "Type Detail",
				"content": "We spent an entire day playing with type design. First we picked out a few font styles we would potentially use. I ended up with a sans-serif font called, Rubik. I like it because it has a lot of different weights to choose from and it has a business casual feel. It’s straight, but the edges are slightly rounded, which makes it a bit more approachable than something like Arial. <br><br>Once we figured out our font style, we tried different ways to display header and paragraph text. I experimented with a lot of different styles and variations of line-spacing, column widths, font weights and header shapes. I tried everything from a header that sat on a wavy line to one that runs along a corner. It was fun to try different styles and combinations, but I ended up going with the traditional horizontal header over a block of text."
			},
			{
				"module": "figure",
				"filePath": "images/projects/portfolio/personal-site-type-design.png",
				"altText":	"Variations of the header and paragraph text.",
				"figureHeading": "Moodboard",
				"caption": "Trying different variations of the header and paragraph. Played with line spacing, font weights, text-alignments and more."
			},
			{	
				"module": "generic-text",
				"subHeader": "Design Inspo",
				"content": "Now it was time to create mockups of our site in Affinity Designer. When the options are limitless, it’s hard for me to start. I knew I didn’t want a traditional top down site with a header, main, and footer. While I still have those three components, I wanted it to be “different” than your normal business style website. I was actually inspired by the very first part of this site <a href='https://www.wokine.com/en/' target='_blank'>wokine.com</a>. I liked how the page was divided. I decided I would incorporate that division throughout my portfolio. I went through numerous iterations of each page with different fonts (yes, I changed my mind on it a few times)."
			},
			{ 
				"module": "figure",
				"filePath": "images/projects/portfolio/wokine.png",
				"altText":	"Variations of the header and paragraph text.",
				"figureHeading": "Moodboard",
				"caption": "Screenshot of Wokine homepage"
			},
			{	
				"module": "generic-text",
				"subHeader": "Layout on the Grid",
				"content": "Once I felt good about my layout it was time to actually build it…but how? I really struggled with how I was going to build it because of my unique layout (unique to me at least). I went into Codepen to try to figure out how I was going to get this split background using grid. I tried several different ways, but none of them achieved what I wanted. I was actually close to giving up and just switching to a traditional layout, but after talking to my mentor, Derek, he let me know I can do whatever I want to make it work. Ah ha! I was trying to build my unorthodox layout using the traditional blueprint we’ve been taught. Once I let that go, I was able to get a bit more creative with my solution and create my layout exactly how I envisioned it!" 
			},
			{
				"module": "figure",
				"filePath": "images/projects/portfolio/layout-on-grid.png",
				"altText":	"Mockup of portfolio site in Affinity Designer.",
				"figureHeading": "Moodboard",
				"caption": "Mockup of my site in Affinity Designer accounting for different screen sizes."
			}
		]
	}
]